---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotAllowedCableTrayConduitRotation
source: html/81cb7213-47eb-ce6f-cde9-38ce88dcad75.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ElectricalFailures.NotAllowedCableTrayConduitRotation Property

Don't allow to rotate a horizontal cable tray/conduit like this

## Syntax (C#)
```csharp
public static FailureDefinitionId NotAllowedCableTrayConduitRotation { get; }
```